samples/ITI-45_request_raw.xml

<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
 <env:Header>
  <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">
   https://epd-test.ith-icoserve.com:7443/PIXPDQ/services/PIXPDQV3ManagerService
  </wsa:To>
  <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">urn:uuid:c12e1f14-c2c9-4a94-ba27-6411e8c90b75</wsa:MessageID>
  <wsa:ReplyTo xmlns:wsa="http://www.w3.org/2005/08/addressing">
   <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
  </wsa:ReplyTo>
  <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing" env:mustUnderstand="1">urn:hl7-org:v3:PRPA_IN201309UV02</wsa:Action>
 </env:Header>
 <env:Body>
  <PRPA_IN201309UV02 xmlns="urn:hl7-org:v3" ITSVersion="XML_1.0">
   <id extension="1694523036420" root="1.3.6.1.4.1.21367.2017.2.7.141"/>
   <creationTime value="20230912131951"/>
   <interactionId extension="PRPA_IN201309UV02" root="2.16.840.1.113883.1.18"/>
   <processingCode code="T"/>
   <processingModeCode code="T"/>
   <acceptAckCode code="AL"/>
   <receiver typeCode="RCV">
    <device classCode="DEV" determinerCode="INSTANCE">
     <id root="1.3.6.1.4.1.21367.2017.2.4.136"/>
    </device>
   </receiver>
   <sender typeCode="SND">
    <device classCode="DEV" determinerCode="INSTANCE">
     <id root="1.3.6.1.4.1.21367.2017.2.2.140"/>
    </device>
   </sender>
   <controlActProcess classCode="CACT" moodCode="EVN">
    <code code="PRPA_TE201309UV02" displayName="2.16.840.1.113883.1.18"/>
    <authorOrPerformer typeCode="AUT">
     <assignedPerson classCode="ASSIGNED">
      <id root="1.3.6.1.4.1.21367.2017.2.5.108"/>
     </assignedPerson>
    </authorOrPerformer>
    <queryByParameter>
     <queryId extension="1694523036421" root="1.3.6.1.4.1.21367.2017.2.7.141"/>
     <statusCode code="new"/>
     <responsePriorityCode code="I"/>
     <parameterList>
      <dataSource>
       <value root="1.3.6.1.4.1.21367.2017.2.5.93"/>
       <semanticsText>DataSource.id</semanticsText>
      </dataSource>
      <dataSource>
       <value root="2.16.756.5.30.1.127.3.10.3"/>
       <semanticsText>DataSource.id</semanticsText>
      </dataSource>
      <patientIdentifier>
       <value extension="900010" root="1.3.6.1.4.1.21367.2017.2.5.103"/>
       <semanticsText>Patient.id</semanticsText>
      </patientIdentifier>
     </parameterList>
    </queryByParameter>
   </controlActProcess>
  </PRPA_IN201309UV02>
 </env:Body>
</env:Envelope>
